import 'package:flutter_application_1/models/section_model.dart';

List<SectionModel> getSections() {
  return [
    SectionModel(
        title: 'Дөңгелек қайтымды және қайтымсыз процеcстер',
        imagePaths: [
          'assets/1.png',
          'assets/1_formula1.png',
          'assets/1_formula2.png',
          'assets/1_formula3.png',
          'assets/1_formula4.png',
          'assets/1_formula5.png',
          'assets/empty.png',
        ],
        descriptions: [
          "Термодинамиканың екінші заңын қарастырмас бұрын дөңгелек процесcтерді қарастыралық. Дөңгелек процесс немесе цикл деп термодинамикалық дене нәтижесінде бастапқы күйіне қайтып оралатын процеcсті айтады. P,V және басқа күй диаграммаларында дөңгелек процесcтер тұйық қисық түрінде кескінделеді  Бұның себебі екі тепе-тең күйлер (процесcтің басы мен аяғы) жазықтықта сол бір нүктемен кескінделеді.",
          "Идеал газ атқаратын жұмысты ұлғаю (1-2) және сығылу (2-1) процесcтеріне бөлуге болады. Ұлғаю жұмысы (1а2V2V11 фигура ауданымен анықталады) оң (dV>0), сығылу жұмысы (2в1V2V12 фигура ауданымен анықталады) теріс (dV<0). Демек, цикл ішінде атқарылатын жұмыс тұйық қисық қамтыған ауданмен анықталады. Егер цикл ішінде оң жұмыс атқарылатын болса (цикл сағат тілімен өтеді),",
          "онда ол тура деп аталады (7.1-сурет). Егер цикл теріс жұмыс жасайтын болса (цикл сағат тіліне қарсы өтеді),",
          "онда ол кері деп аталады (7.1-сурет). \n Циклдік процесcтер жылулық машиналар негізіне алынған: іштен жану қозғалтқышы, бу және газ турбиналары, бу және суытқыш машиналары және т.б.\n Дөңгелек процесc нәтижесінде жүйе бастапқы күйге оралады. Олай болса газдың ішкі энергиясының толық өзгерісі нольге тең болады. Сондықтан циклдік процесc үшін термодинамиканың бірінші бастамасы былай жазылатын болады",
          "яғни цикл ішінде жасалатын жұмыс сырттан алынатын жылуға тең. Бірақ циклдік процесс нәтижесінде жүйе жылу алуымен қатар жылуды бере алады, сондықтан:",
          "мұндағы Q1 – жүйе алатын жылу мөлшері, Q2 – жүйе беретін жылу мөлшері. \n Сондықтан дөңгелек процесс үшін термиялық пайдалы әсер коэффициенті келесі өрнекпен анықталатын болады:",
          "Барлық термодинамикалық процеcстер, сонымен қатар циклдік процесcтерде екі топқа бөлінеді: қайтымды және қайтымсыз. \nЕгер процесс біткен соң кері бағытта тура бағытта өткен аралық күйлер арқылы өтетін болса, бұл процесс қайтымды процесс деп аталады. Қайтымды дөңгелек процессті өткізгеннен кейін жүйеде қоршаған ортада еш өзгеріс болмайды. Орта деп жүйе тікелей әсерлесетін денелер жүйесіне енбейтін денелер жиынын айтады.\nЕгер жүйені бастапқы күйге аралық күйлер арқылы қайтара алмайтын болсақ, мұндай просесс қайтымсыз процесс деп аталады. Қоршаған ортада еш өзгеріс қалдырмайтын қайтымсыз процесс жасау мүмкін емес. Қайтымдылық қасиетіне тек теңбе-тең процесстер ие бола алады. Әр аралық процесс термодинамикалық теңбе-тең күйі болып есептелінеді және ол күй процесстің қай бағытта өтіп жатқанына тәуелді емес.\nГаздың адиабаталық ұлғаю немесе сығылу процессін қайтымды деп есептеуге болады. Адиабаталық процесс барысында жүйенің жылулық оқшаулану шарты жүйе мен орта арасында тікелей жылу алмасуды қамтамасыз етеді. Сондықтан, газды адибаталық ұлғайта, сосын сыға отырып бастапқы күйіне қайтарғанда қоршаған ортада еш өзгеріс болмайды. Әрине, шынайы жағдайда процесстің кейбір қайтымсыздығы байқалады, мысалы, үйкелістің болуы, жылулық оқшаулануда ақаудың болуы және т.б.\nТек қайтымды процесстерде жылу мақсатпен қолданылады, шығын болмайды. Егер процесс теңбе-тең емес болса, ауысу қайтымсыз болады, яғни энергияның бір бөлігі кетеді.\nМаксимал ПӘК-ке тек қайтымды процестері болатын машиналар ие бола алады.\nНақты процесстер энергияның, біз қарастырмайтын, диссипациялануымен жалғасады (үйкеліс, жылуөткізгіштік және т.б.). Қайтымды процесстер – ол нақты процессті идеал күйге келтірудің бір түрі .Оларды екі себеппен қарастыруға болады:\nтабиғат пен техникадағы көптеген процесстерді қайтымды деуге болады;\nқайтымды процестер экономикалық пайдалы және тиімді және ол жылу қозғалтқыштарының термиялық пайдалы әсер коэффициентін максимал мәнге әкелдіреді."
        ]),
    SectionModel(
        title:
            'Жылу машиналары. Жылу қозғалтқыштары және қоршаған ортаны қорғау',
        descriptions: [
          "Жылу машиналары деп сырттан алынатын жылу есебінен жұмыс атқаратын периодты жұмыс жасап тұратын қозғалтқышты айтады. \n",
          "Жылу машиналары жылуды жұмысқа немесе керісінше, жұмысты жылуға айналдырады. \nЖылу машиналары олардағы процестердің өту бағытына байланыстыекі түрлі болып келеді.\n1. Жылу қозғалтқыштары сыртқы жылу көзінен келетін жылуды жұмысқа айналдырады. Іштен жанатын автомобиль қозғалтқышы –бұл жылу қозғалтқышының, мысалы, онда жанар май жанған кезде жылу автомобильдің механикалық энергиясына айналады.\n2. Суытқыш машиналар сыртқы көздің механикалық жұмысы есебінен жылуды азырақ қызған денеден көбірек қызған денеге береді. Сіздің пәтеріңізде тұрған тұрмыстық мұздатқыш суытқыш машинасының мысалы болып табылады. Онда жылу суытқыш камерадан алынып қоршаған кеңістікке беріледі.",
          "\nКез келген жылу машинасы циклдік процесс принципі бойынша жұмыс жасайды, яғни бастапқы күйге оралады (7.1-сурет). Бұндайда оң жұмыс жасалуы керек, демек қайта оралу аз шығынмен өтуі керек. Пайдалы жұмыс ұлғаю және сығылу жұмыстарының айырымына тең болады, яғни тұйық қисықпен шектелген ауданға тең. Жылу машинасының негізгі бөліктері қыздырғыш (энергия көзі), мұздатқыш, жұмыс денесі (газ,бу). Мұздатқыш неге керек? Жылу машинасында дөңгелек процесс жүзеге асырылатындықтан, бастапқы күйге аз шығынмен оралуға болады. Немесе, егер буды салқындатсақ, онда газды сығу оңай болады, демек сығу жұмысы ұлғаю жұмысынан аз болады. Сондықтан жылу машиналарында мұздатқыш қолданылады.",
          "\nТікелей цикл жылу қозғалтқышында қолданылады – периодты жұмыс жасап тұрған жылу машинасында, яғни сырттан алынған жылу есебінен жұмыс жасайтын. Жылу қозғалтқышының сызбасын қарастыралық (7.2-сурет).\n Қыздырғыш деп аталатын температурасы жоғары термостаттан Т1, цикл ішінде Q1 жылу мөлшері алынады, ал мұздатқыш деп аталатын температурасы термостатқа Q2 жылу мөлшері беріледі және А жұмыс жасалады:",
          "Кері цикл суытқыш машиналарында қолданылады – периодты жұмыс атқарып тұрған қондырғыларда, яғни сыртқы күштер жұмысы есебінен жылу температурасы жоғары денеге беріледі. Суытқыш машинасының жұмыс істеу принципі 7.3-суретте көрсетілген. Цикл ішінде жүйе Т2 төменгі температурада Q2 жылу мөлшерін жұтады және Т1 жоғары температурада Q1 жылу мөлшерін сыртқы күштер жұмысының есебінен береді.\nЖылу қозғалтқыштары және қоршаған ортаны қорғау. Жылу қозғалтқыштары қоршаған ортаға көп зиян келтіреді. Оларды жан-жақты қолдану бірқатар теріс құбылыстарға әкелдіреді.\n1. Жылу энергиясының көп мөлшерінің атмосфераға шашырауы планетадағы температураның ұлғаюына әкелдіреді. Ауа райының межеден артық жылып кетуі мұздықтардыңеруіне және үлкен қатерлердің пайда болуына әкеліп соғады.\n2. Ауа райының жылуына,Жердің жылулық сәулеленуінің кетуін тежейтін, атмосферадағы көмірқышқыл газының көп мөлшерде жинақталуыда себепкер болады(парниктік эффект).\n3. Жанар майдың жану барысында оның өнімдерінің концентрациясының жоғары болуына байланысты экологиялық жағдай нашарлайды.\nБұл барлық тіршілік әлемінің проблемасы.Жылу қозғалтқыштарының келтіретін теріс нәтижелерімен күресу үшін олардың ПӘК-ін арттыру керек,зиянды заттардың бөлінуін азайту керек,жанар майдың жаңа түрлерін ойлап табу керек және энергияны үнемді жұмсау керек."
        ],
        imagePaths: [
          "assets/2.png",
          "assets/2_formula1.png",
          "assets/2_formula2.png",
          "assets/2_formula3.png",
          "assets/empty.png",
          "assets/empty.png",
        ]),
    SectionModel(title: "Карно циклі", imagePaths: [
      "assets/4.png",
      "assets/4_formula1.png",
      "assets/4_formula2.png",
      "assets/empty.png",
    ], descriptions: [
      "Карно Никола Леонард Сади (1796-1832 жж.) – француз физигі және инженері, термодинамиканың негізін қалаушылардың бірі. Ол алғаш рет жұмысты жылу қызған денеден салқын денеге ауысқан кезде алуға болатынын көрсетті (термодинамиканың екінші бастамасы). Жылу машиналарының идеал циклі үшін дөңгелек және қайтымды процестер түсінігін енгізді және солардың теориясының негізін жасады. Механикалық жылу эквивалентінің түсінігін берді. 1824 жылы «Размышления о движущей силе огня и о машинах способных развить эту силу» атты еңбегін жария етті.\nТермодинамиканың екінші заңына сүйене отырып Карно өзінің келесі теоремасын ұсынды:\n\nПериодты жұмыс жасап тұрған,қыздырғыштары мен суытқыштарының температуралары бірдей, барлық жылу машиналарының ішінен қайтымды машиналардың ПӘК-і ең жоғары болады және ол бірден кіші.\n\nКарно зерттеген циклдің тиімдісі екі изотерма мен екі адиабаттан тұратын дөңгелек процесті береді (7.4-сурет).\n\nЖұмыс денесі орнына қозғалмалы поршені бар ыдыс ішіне құйылған идеал газды алалық. Соның ПӘК-ін анықталық.\nІстелген жұмыс максимал болатындай етіп, жылуды жұмысқа айналдыратын дөңгелек процесcті қарастыралық. Еске түсіре кетелік, жылу машинасы деп сырттан алынатын жылу есебінен жұмыс жасайтын және қыздырғышы, суытқышы мен жұмыс денесі бар периодты жұмыс жасайтын қозғалтқышты айтады. Қыздырғыш пен мұздатқыштың жылу сыйымдылығы шексіз деп есептелік, яғни олардың температуралары жылу беру барысында өзгермейтін болады.",
      "Процесті әуелі сапалы түрде қарастыралық. Процесcті А нүктесінен басталық. Газ Р0 қысымға дейін сығылған және Т1 температурада қыздырғышпен контактіде тұр. Газдың ұлғаюы қай процесте максимал жұмысты береді? Термодинамикадағы энергияның сақталу заңын еске түсірелік:",
      "Изотермиялық процесте dU=0, демек барлық жылу жұмысқа өтеді:",
      """Сонымен, АВ – бөлікте Т1 температурадағы изотермиялық ұлғаю жүреді (жылу беру процесі болмайды,себебі температуралар айырымы жоқ, яғни жылу берусіз жұмыста жасалмайды, процесс қайтымды).
Жұмыс денесі алған жылуды мұздатқышқа беруіміз керек. Егер тек мұздатқышпен жанастыратын болсақ, онда жылу беру процесcі жұмыссыз өтетін болады. Сондықтан, әуелі жұмыс денесін Т2-ге дейін суыту керек (ал жылу шығындамай суыту – ол адиабаталық ұлғаю ВС бөлігі), содан кейін суытқышқа жалғауымыз керек. Адиабаталық ұлғаюмен циклдің бірінші жартысы бітеді – пайдалы жұмыс жасалады.\n\n
Енді жұмыс денесін бастапқы күйге қайтару керек, яғни газды Р0-ге дейін сығу керек. Жұмыс денесі қыздырғыш температурасына Т1-ге жеткенше қыздырғышпен байланыс болмау керек.\n\n
А нүктесіне қайтып оралу екі сатыда өтеді: мұздатқышпен байланысты үзбей отырып жұмыс денесі сығылады, бұл кезде мұздатқышқа изотермиялық СД сығылу барысында Q2 жылу беріледі. Содан кейін денені мұздатқыштан оқшаулап адиабаталық жолмен сығады, бұл кезде оның температурасы Т1-ге (ДА) дейін көтеріледі. Жұмыс денесі адиабаталық сығылу кезінде өзімен жасалған сыртқы жұмыс есебінен қызады.\n\n
Байқап отырғанымыздай дөңгелек процесстің барлық сатыларында дененің әр түрлі температуралармен жанасу болмайды, яғни жылуөткізгіштіктің қайтымсыз процесстері жоқ. Барлық цикл шексіз баяу түрде қайтымды жүргізіледі."""
    ]),
    SectionModel(
        title: "Жұмыс және Карно циклының пайдалы әсер коэффициенті",
        imagePaths: [
          "assets/5.png",
          "assets/5_formula1.png",
          "assets/5_formula2.png",
          "assets/5_formula3.png",
          "assets/5_formula4.png",
          "assets/5_formula5.png",
          "assets/5_formula6.png",
          "assets/5_formula7.png",
          "assets/5_formula8.png",
          "assets/5_formula9.png",
          "assets/5_formula10.png",
          "assets/5_formula11.png",
          "assets/empty.png",
          "assets/empty.png",
          "assets/empty.png",
        ],
        descriptions: [
          """Карно циклінің пайдалы жұмысын табалық. 7.4-суретті қарастыралық.\n\n
А – В процессі – изотермиялық ұлғаю. Газдың бір мольінің V0-ден V1-ге дейін изотермиялық ұлғаюы кезінде оң жұмыс жасалады. Қыздырғыштан алынған Q1 жылу газдың изотермиялық ұлғаюына жұмсалады және де ол A1 жұмыс жасайтын болады:""",
          """В – С процесcі – адиабаталық ұлғаю. Адиабаталық ұлғаю кезінде қоршаған ортамен жылу алмасу болмайды және ұлғаю жұмысы А2 ішкі энергияның өзгеру есебінен жүреді.\n\n
Адиабатаның теңдеуі:""",
          """Бұл кезде қысым Р2-ге дейін өзгереді. Осы сатыда алынған жұмыс төмендегідей болады:""",
          """Бұл кезде қысым Р2-ге дейін өзгереді. Осы сатыда алынған жұмыс төмендегідей болады:""",
          """С – D процесcі – изотермиялық сығылу. Үшінші сатыда газ изотермиялық V1 -ден V2-ге дейін сығылады. Изотермиялық сығылу кезінде мұздатқышқа берілген Q2 жылу сығылу жұмысына тең А3 газбен жасалатын ол жұмыс теріс:""",
          """D – A процеcсі – адиабаталық сығылу.\n\n

Адиабатаның теңдеуі: """,
          """Соңғы сатыдағы сығылу жұмысы:""",
          """Циклдің жалпы жұмысы A=A1 + A2 + A3 + A4 немесе""",
          "деп белгілелік, сонда:",
          "Сонымен, жұмыс АВСDА қисығымен шектелген ауданға тең.\n\nТеңдіктен шығатыны:",
          "Пайдалы жұмыс:",
          "Пайдалы әсер коэффициент η былай анықталатын болады:",
          """(7.9) өрнектен η<1 болатыны байқалады, яғни қыздырғыш пен мұздатқыш температураларының айырымына тәуелді және машина құрылымы мен жұмыс дене тегіне байланыссыз. Бұл Карно теоремасының тағы да бір тұжырымдамасы.\n\n
Біз қарастырған Карно циклінде ол цикл барлық сатыларында қайтымсыз процесcтер болмайтындай жүргізілді (дененің әр түрлі температуралармен жанасуы болмады). Сондықтан мұнда ең үлкен ПӘК. Бұдан көп алу мүмкін емес.""",
        ]),
    SectionModel(
        title:
            "Келтірілген жылу. Энтропия. Изопроцесстердегі энтропия өзгерісі",
        imagePaths: [
          "assets/6.jpg",
          "assets/6_formula1.png",
          "assets/6_formula2.png",
          "assets/6_formula3.png",
          "assets/6_formula4.png",
          "assets/6_formula5.png",
          "assets/6_formula6.png",
          "assets/6_formula7.png",
          "assets/6_formula8.png",
          "assets/6_formula9.png",
          "assets/6_formula10.png",
          "assets/6_formula11.png",
          "assets/6_formula12.png",
          "assets/empty.png",
          "assets/empty.png",
          "assets/empty.png",
        ],
        descriptions: [
          "Қарастырған Карно циклінен көріп отырғанымыздай изотермиялық процесс кезінде алынған немесе берілген жылу мөлшерлерінің температураларға қатынасы өзара тең болады:",
          "Жылу берілген уақытта изотермиялық процесс кезінде жылу мөлшерінің температураға қатынасы келтірілген жылу Q' деп аталады:",
          "Кез-келген процесс кезінде келтірілген жылу мөлшерін есептеу үшін осы процессті шексіз кішкене бөліктерге бөлу қажет (Т=const). Осы бөліктегі келтірілген жылу мөлшері δQ/T-ға тең.\n\nБарлық бөліктердегі келтірілген жылу мөлшерлерін қосып, мынаны аламыз:",
          "Сонда қайтымды Карно циклінде:",
          "Бұл қорытынды кез-келген қайтымды процесске дұрыс шешім.\nОсылайша, тұйық циклде болып жатқан процесс үшін:",
          "Тұйық контурдан алынған, нольге тең интегралдан шығатыны – интеграл асты өрнегі",
          "ол тек жүйе күйімен анықталатын және осы күйге жеткен жолдарға тәуелсіз жүйе кейбір функциялардың толық дифференциалы болып табылады. Ол бізге жаңа S күйдегі функцияны енгізуге мүмкіндік береді:",
          "Толық дифференциалы",
          " -ға тең күй функциясы энтропия (грек. еntropia – бұрылыс, айналу) деп аталады, яғни жылудың басқа энергия түрлеріне айналуға қабілеттілік шарасы.",
          """Энтропия (S) – ол процесс болып жатқан кездегі температурадан алынған немесе оған берілген жылудың өзара байланысы.\n\n
Энтропия ұғымын ең алғаш Р. Клаузиус 1854 жылы енгізген болатын. Рудольф Клаузиус (1822-1888 жж.) – неміс физигі, теоретик, термодинамика мен газдардың кинетикалық теориясының негізін қалаушылардың бірі. Оның еңбектері молекулалық физика, термодинамика, бу машиналарының теориясына, теориалық механика және математикалық физикаға арналған. Карно идеяларын дамыта отырып, жылу мен жұмыстың эквиваленттілік принципін дәл тұжырымдады. 1850 жылы жылу мен механикалық жұмыстың ортақ өзара байланысын алды (термодинамиканың бірінші бастамасы) және бу машинасының идеалдық термодинамикалық циклін ойлап тапты (Ранкин – Клаузиус циклі).\n
Қайтымды процесстер үшін энтропия өзгерісі:""",
          """Бұл өрнек Клаузиус теңдігі деп аталады.\n\n
Изопроцестердегі энтропия өзгерісі. Кез-келген тұрақтыға дейінгі дәлдікпен анықталған жүйенің энтропиясы оның күй функциясы болып табылады.\n
Егер жүйе 1-күйден 2-күйге тепе-тең ауысу жасаса, онда энтропия өзгерісі:""",
          "Осылайша, (7.10) өрнек бойынша энтропияны аддитивтік тұрақтыға дейінгі ғана дәлдікпен анықтауға болады. Физикалық мағынасы энтропия айырмашылығы ғана болып табылады.\nОсыдан идеал газ процессіндегі энтропия өзгерісін табайық.\n\nT=const болғандықтан,",
          "немесе",
          """Осылайша, 1-күйден 2-күйге өткен кездегі идеал газдың энтропия өзгерісі ∆S1→2 ауысу түріне 1-2 тәуелсіз болады.\n
Идеал газ изопроцесcтерінің әрқайсысы өзінің энтропия өзгерісімен бейнеленеді:""",
          "Соңғы өрнекте адиабаталық процесcті изоэнтропиялық процесс деп атайтынын айтып өтейік, себебі S=const."
        ])
  ];
}
